---
kind: type
id: T:Autodesk.Revit.UI.Events.ApplicationClosingEventArgs
source: html/24e97531-4f9d-495f-a87e-3de452ab452c.htm
---
# Autodesk.Revit.UI.Events.ApplicationClosingEventArgs

The event arguments used by the ApplicationClosing event.

## Syntax (C#)
```csharp
public class ApplicationClosingEventArgs : RevitAPIPreEventArgs
```